In [420]:
import pandas as pd
import numpy as np
import pymysql as mysql
import regex as rgx
from sqlalchemy import create_engine

In [421]:
requiredFields = ['show_id', 'title', 'type', 'country', 'release_year', 'duration']

In [422]:
# Reading data set to start with data wrangling
netflix_titles_dataset = pd.read_csv('./netflix_titles.csv', usecols=requiredFields)

In [423]:
netflix_titles_dataset

,show_id,type,title,country,release_year,duration
0,s1,Movie,Dick Johnson Is Dead,United States,2020,90 min
1,s2,TV Show,Blood & Water,South Africa,2021,2 Seasons
2,s3,TV Show,Ganglands,NaN,2021,1 Season
3,s4,TV Show,Jailbirds New Orleans,NaN,2021,1 Season
4,s5,TV Show,Kota Factory,India,2021,2 Seasons
...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,United States,2007,158 min
8803,s8804,TV Show,Zombie Dumb,NaN,2018,2 Seasons
8804,s8805,Movie,Zombieland,United States,2009,88 min
8805,s8806,Movie,Zoom,United States,2006,88 min
8806,s8807,Movie,Zubaan,India,2015,111 min

In [424]:
dim_type = pd.DataFrame({
  'type': netflix_titles_dataset['type'].drop_duplicates().reset_index(drop=True),
  'type_initial': (np.where(netflix_titles_dataset['type'].drop_duplicates() == 'Movie', 'm', 't'))}) 
dim_type.insert(0, 'id_type', range(1, len(dim_type) + 1))

In [425]:
dim_type

   id_type     type type_initial
0        1    Movie            m
1        2  TV Show            t

In [426]:
# netflix_titles_dataset['director'] = netflix_titles_dataset['director'].fillna('Unknown');
# dim_director = pd.DataFrame({
#   'director': netflix_titles_dataset['director'].drop_duplicates().reset_index(drop=True)}) 
# dim_director.insert(0, 'id_director', range(1, len(dim_director) + 1))

In [427]:
dim_director

      id_director                       director
0               1                Kirsten Johnson
1               2                        Unknown
2               3                Julien Leclercq
3               4                  Mike Flanagan
4               5  Robert Cullen, José Luis Ucha
...           ...                            ...
4524         4525                         Mu Chu
4525         4526        Chandra Prakash Dwivedi
4526         4527                Majid Al Ansari
4527         4528                   Peter Hewitt
4528         4529                    Mozez Singh

[4529 rows x 2 columns]

In [428]:
netflix_titles_dataset['country'] = netflix_titles_dataset['country'].fillna('Unknown');
dim_country = pd.DataFrame({
  'movie_countries': netflix_titles_dataset['country'].drop_duplicates().reset_index(drop=True),
  'is_multiple': (np.where(netflix_titles_dataset['country'].drop_duplicates().str.contains('min') == True, '', False))}) 
dim_country.insert(0, 'id_country', range(1, len(dim_country) + 1))

In [429]:
dim_country

     id_country                                    movie_countries is_multiple
0             1                                      United States       False
1             2                                       South Africa       False
2             3                                            Unknown       False
3             4                                              India       False
4             5  United States, Ghana, Burkina Faso, United Kin...       False
..          ...                                                ...         ...
744         745                                      Russia, Spain       False
745         746              Croatia, Slovenia, Serbia, Montenegro       False
746         747                                      Japan, Canada       False
747         748      United States, France, South Korea, Indonesia       False
748         749                       United Arab Emirates, Jordan       False

[749 rows x 3 columns]

In [430]:
netflix_titles_dataset['release_year'] = netflix_titles_dataset['release_year']
dim_year = pd.DataFrame({
  'year': netflix_titles_dataset['release_year'].drop_duplicates().reset_index(drop=True)}) 
dim_year.insert(0, 'id_year', range(1, len(dim_year) + 1))

In [431]:
dim_year

    id_year  year
0         1  2020
1         2  2021
2         3  1993
3         4  2018
4         5  1996
..      ...   ...
69       70  1942
70       71  1955
71       72  1944
72       73  1947
73       74  1943

[74 rows x 2 columns]

In [432]:
netflix_titles_dataset['duration'] = netflix_titles_dataset['duration']
dim_duration = pd.DataFrame({
  'duration': netflix_titles_dataset['duration'].drop_duplicates().reset_index(drop=True),
  'duration_type': (np.where(netflix_titles_dataset['duration'].drop_duplicates().str.contains('min') == True, 'time', 'season(s)'))}) 
dim_duration.insert(0, 'id_duration', range(1, len(dim_duration) + 1))

In [433]:
dim_duration

     id_duration   duration duration_type
0              1     90 min          time
1              2  2 Seasons     season(s)
2              3   1 Season     season(s)
3              4     91 min          time
4              5    125 min          time
..           ...        ...           ...
216          217    228 min          time
217          218     18 min          time
218          219    205 min          time
219          220    201 min          time
220          221    191 min          time

[221 rows x 3 columns]

In [434]:
fact_movie = netflix_titles_dataset
fact_movie = pd.merge(dim_type, fact_movie, how='inner', left_on='type', right_on='type').drop(['type_initial', 'type'], axis = 1)
# fact_movie = pd.merge(dim_director, fact_movie, how='inner', left_on='director', right_on='director').drop(['director'], axis = 1)
fact_movie = pd.merge(dim_country, fact_movie, how='inner', left_on='movie_countries', right_on='country').drop(['movie_countries', 'is_multiple', 'country'], axis = 1)
fact_movie = pd.merge(dim_year, fact_movie, how='inner', left_on='year', right_on='release_year').drop(['release_year', 'year'], axis = 1)
fact_movie = pd.merge(dim_duration, fact_movie, how='inner', left_on='duration', right_on='duration').drop(['duration', 'duration_type'], axis = 1)

,id_duration,id_year,id_country,id_type,show_id,title
0,1,1,1,1,s1,Dick Johnson Is Dead
1,1,1,1,1,s230,The Old Ways
2,1,1,1,1,s1732,A New York Christmas Wedding
3,1,1,1,1,s1988,Residue
4,1,1,1,1,s2233,Fatal Affair
...,...,...,...,...,...,...
8802,217,49,4,1,s7933,Sangam
8803,218,70,1,1,s8206,The Battle of Midway
8804,219,28,707,1,s8328,The Gospel of Luke
8805,220,19,716,1,s8405,The Lord of the Rings: The Return of the King
8806,221,27,1,1,s8765,Wyatt Earp

In [435]:
try: connection = mysql.connect(host='db-udlsb.cdzdfws2acz2.us-east-1.rds.amazonaws.com', user='adminSalle', password='Walito17$'); print ('Succesfully connected to MySQL Server')
except: print ('Cannot connect to MySQL Server')

Succesfully connected to MySQL Server

In [436]:
# Creates new cursor from MySQL connection
cur = connection.cursor()
# Drops database to fill new data
try:
  cur.execute("DROP DATABASE IF EXISTS dm_movies")
  cur.execute("CREATE DATABASE dm_movies")
  connection.commit()
except:
  print ("Query Error")
cur.close()

In [437]:
# Creates engine for database "dm_datamart"
engine = create_engine('mysql+pymysql://adminSalle:Walito17$@db-udlsb.cdzdfws2acz2.us-east-1.rds.amazonaws.com/dm_movies')

In [438]:
dim_type.to_sql('dim_type', engine, if_exists='replace', index=False)

In [439]:
dim_country.to_sql('dim_country', engine, if_exists='replace', index=False)

In [440]:
dim_year.to_sql('dim_year', engine, if_exists='replace', index=False)

In [441]:
dim_duration.to_sql('dim_duration', engine, if_exists='replace', index=False)

In [442]:

# dim_director.to_sql('dim_director', engine, if_exists='replace', index=False)

In [443]:
# fact_movie.iloc[[401]].show_id
fact_movie = fact_movie[fact_movie.show_id != 's2999']
fact_movie = fact_movie[fact_movie.show_id != 's6178']
fact_movie = fact_movie[fact_movie.show_id != 's5979']
fact_movie = fact_movie[fact_movie.show_id != 's7102']
fact_movie = fact_movie[fact_movie.show_id != 's2640']
fact_movie = fact_movie[fact_movie.show_id != 's4915']
fact_movie = fact_movie[fact_movie.show_id != 's5975']
fact_movie = fact_movie[fact_movie.show_id != 's8775']
fact_movie = fact_movie[fact_movie.show_id != 's4668']
fact_movie = fact_movie[fact_movie.show_id != 's5023']
fact_movie = fact_movie[fact_movie.show_id != 's2618']
fact_movie = fact_movie[fact_movie.show_id != 's1217']
fact_movie = fact_movie[fact_movie.show_id != 's7391']
fact_movie = fact_movie[fact_movie.show_id != 's1217']
fact_movie = fact_movie[fact_movie.show_id != 's1217']

In [444]:
fact_movie.head(4000).to_sql('fact_movie', engine, if_exists='replace', index=False)